thermo-emacs-notes.org
* Introduction

These are the configuration related to my note-taking workflow, mainly based on deft and markdown mode

First, do the initial setting for markdown mode.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/markdown-mode/")
(require 'markdown-mode)
(autoload 'markdown-mode "markdown-mode"
       "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
(add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
#+END_SRC

Enable its markdown mode:

#+BEGIN_SRC emacs-lisp
(markdown-enable-math)
#+END_SRC

Now, configure deft mode. I use the "extended version", which enables multiple file extensions and modes. I use markdown as default.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/deft/")
(require 'deft)

(setq deft-extensions '("txt" "org" "taskpaper" "md"))
(setq deft-default-extension "md")
(setq deft-directory "~/Dropbox/notes")
(setq deft-text-mode 'markdown-mode)
(global-set-key [f8] 'deft)
(setq deft-use-filename-as-title t)
#+END_SRC
